stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_ll_bus.h
/**
  * @brief  Check if APB2 peripheral clock is enabled or not
  * @rmtoll APB2ENR      TIM1EN        LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      SPI1EN        LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      USART1EN      LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      TIM16EN       LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      TIM17EN       LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      SAI1EN        LL_APB2_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1 (*)
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB2ENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB2 peripherals clock.
  * @rmtoll APB2ENR      TIM1EN        LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      SPI1EN        LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      USART1EN      LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      TIM16EN       LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      TIM17EN       LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      SAI1EN        LL_APB2_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2ENR, Periphs);
}

/**
  * @brief  Force APB2 peripherals reset.
  * @rmtoll APB2RSTR      TIM1RST        LL_APB2_GRP1_ForceReset\n
  *         APB2RSTR      SPI1RST        LL_APB2_GRP1_ForceReset\n
  *         APB2RSTR      USART1RST      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTR      TIM16RST       LL_APB2_GRP1_ForceReset\n
  *         APB2RSTR      TIM17RST       LL_APB2_GRP1_ForceReset\n
  *         APB2RSTR      SAI1RST        LL_APB2_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @brief  Release APB2 peripherals reset.
  * @rmtoll APB2RSTR      TIM1RST        LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTR      SPI1RST        LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTR      USART1RST      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTR      TIM16RST       LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTR      TIM17RST       LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTR      SAI1RST        LL_APB2_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @brief  Enable APB2 peripheral clocks in Sleep and Stop modes
  * @rmtoll APB2SMENR     TIM1SMEN       LL_APB2_GRP1_EnableClockStopSleep\n
  *         APB2SMENR     SPI1SMEN       LL_APB2_GRP1_EnableClockStopSleep\n
  *         APB2SMENR     USART1SMEN     LL_APB2_GRP1_EnableClockStopSleep\n
  *         APB2SMENR     TIM16SMEN      LL_APB2_GRP1_EnableClockStopSleep\n
  *         APB2SMENR     TIM17SMEN      LL_APB2_GRP1_EnableClockStopSleep\n
  *         APB2SMENR     SAI1SMEN       LL_APB2_GRP1_EnableClockStopSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClockStopSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB2SMENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB2SMENR, Periphs);
  (void)tmpreg;
}


/**
  * @brief  Check if APB2 peripheral clocks in Sleep and Stop modes is enabled or not
  * @rmtoll APB2SMENR     TIM1SMEN       LL_APB2_GRP1_IsEnabledClockStopSleep\n
  *         APB2SMENR     SPI1SMEN       LL_APB2_GRP1_IsEnabledClockStopSleep\n
  *         APB2SMENR     USART1SMEN     LL_APB2_GRP1_IsEnabledClockStopSleep\n
  *         APB2SMENR     TIM16SMEN      LL_APB2_GRP1_IsEnabledClockStopSleep\n
  *         APB2SMENR     TIM17SMEN      LL_APB2_GRP1_IsEnabledClockStopSleep\n
  *         APB2SMENR     SAI1SMEN       LL_APB2_GRP1_IsEnabledClockStopSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1 (*)
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB2_GRP1_IsEnabledClockStopSleep(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB2SMENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB2 peripheral clocks in Sleep and Stop modes
  * @rmtoll APB2SMENR     TIM1SMEN        LL_APB2_GRP1_DisableClockStopSleep\n
  *         APB2SMENR     SPI1SMEN        LL_APB2_GRP1_DisableClockStopSleep\n
  *         APB2SMENR     USART1SMEN      LL_APB2_GRP1_DisableClockStopSleep\n
  *         APB2SMENR     TIM16SMEN       LL_APB2_GRP1_DisableClockStopSleep\n
  *         APB2SMENR     TIM17SMEN       LL_APB2_GRP1_DisableClockStopSleep\n
  *         APB2SMENR     SAI1SMEN        LL_APB2_GRP1_DisableClockStopSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_DisableClockStopSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2SMENR, Periphs);
}

/**
  * @}
  */


/** @defgroup BUS_LL_EF_APB7 APB7
  * @{
  */

/**
  * @brief  Enable APB7 peripherals clock.
  * @rmtoll APB7ENR      SYSCFGEN       LL_APB7_GRP1_EnableClock\n
  *         APB7ENR      SPI3EN         LL_APB7_GRP1_EnableClock\n
  *         APB7ENR      LPUART1EN      LL_APB7_GRP1_EnableClock\n
  *         APB7ENR      I2C3EN         LL_APB7_GRP1_EnableClock\n
  *         APB7ENR      LPTIM1EN       LL_APB7_GRP1_EnableClock\n
  *         APB7ENR      COMPEN         LL_APB7_GRP1_EnableClock\n
  *         APB7ENR      RTCAPBEN       LL_APB7_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB7_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB7_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB7_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB7_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB7_GRP1_PERIPH_COMP (*)
  *         @arg @ref LL_APB7_GRP1_PERIPH_RTCAPB
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB7_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB7ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB7ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB7 peripheral clock is enabled or not
  * @rmtoll APB7ENR      SYSCFGEN       LL_APB7_GRP1_IsEnabledClock\n
  *         APB7ENR      SPI3EN         LL_APB7_GRP1_IsEnabledClock\n
  *         APB7ENR      LPUART1EN      LL_APB7_GRP1_IsEnabledClock\n
  *         APB7ENR      I2C3EN         LL_APB7_GRP1_IsEnabledClock\n
  *         APB7ENR      LPTIM1EN       LL_APB7_GRP1_IsEnabledClock\n
  *         APB7ENR      COMPEN         LL_APB7_GRP1_IsEnabledClock\n
  *         APB7ENR      RTCAPBEN       LL_APB7_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB7_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB7_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB7_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB7_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB7_GRP1_PERIPH_COMP (*)
  *         @arg @ref LL_APB7_GRP1_PERIPH_RTCAPB
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB7_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB7ENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB2 peripherals clock.
  * @rmtoll APB7ENR      SYSCFGEN       LL_APB7_GRP1_DisableClock\n
  *         APB7ENR      SPI3EN         LL_APB7_GRP1_DisableClock\n
  *         APB7ENR      LPUART1EN      LL_APB7_GRP1_DisableClock\n
  *         APB7ENR      I2C3EN         LL_APB7_GRP1_DisableClock\n
  *         APB7ENR      LPTIM1EN       LL_APB7_GRP1_DisableClock\n
  *         APB7ENR      COMPEN         LL_APB7_GRP1_DisableClock\n
  *         APB7ENR      RTCAPBEN       LL_APB7_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB7_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB7_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB7_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB7_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB7_GRP1_PERIPH_COMP (*)
  *         @arg @ref LL_APB7_GRP1_PERIPH_RTCAPB
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB7_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB7ENR, Periphs);
}

/**
  * @brief  Force APB7 peripherals reset.
  * @rmtoll APB7RSTR     SYSCFGRST     LL_APB7_GRP1_ForceReset\n
  *         APB7RSTR     SPI3RST       LL_APB7_GRP1_ForceReset\n
  *         APB7RSTR     LPUART1RST    LL_APB7_GRP1_ForceReset\n
  *         APB7RSTR     I2C3RST       LL_APB7_GRP1_ForceReset\n
  *         APB7RSTR     LPTIM1RST     LL_APB7_GRP1_ForceReset\n
  *         APB7RSTR     COMPRST       LL_APB7_GRP1_ForceReset\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB7_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB7_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB7_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB7_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB7_GRP1_PERIPH_COMP (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB7_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APB7RSTR, Periphs);
}

/**
  * @brief  Release APB7 peripherals reset.
  * @rmtoll APB7RSTR     SYSCFGRST     LL_APB7_GRP1_ReleaseReset\n
  *         APB7RSTR     SPI3RST       LL_APB7_GRP1_ReleaseReset\n
  *         APB7RSTR     LPUART1RST    LL_APB7_GRP1_ReleaseReset\n
  *         APB7RSTR     I2C3RST       LL_APB7_GRP1_ReleaseReset\n
  *         APB7RSTR     LPTIM1RST     LL_APB7_GRP1_ReleaseReset\n
  *         APB7RSTR     COMPRST       LL_APB7_GRP1_ReleaseReset\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB7_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB7_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB7_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB7_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB7_GRP1_PERIPH_COMP (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB7_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB7RSTR, Periphs);
}

/**
  * @brief  Enable APB7 peripheral clocks in Sleep and Stop modes
  * @rmtoll APB7SMENR    SYSCFGSMEN    LL_APB7_GRP1_EnableClockStopSleep\n
  *         APB7SMENR    SPI3SMEN      LL_APB7_GRP1_EnableClockStopSleep\n
  *         APB7SMENR    LPUART1SMEN   LL_APB7_GRP1_EnableClockStopSleep\n
  *         APB7SMENR    I2C3SMEN      LL_APB7_GRP1_EnableClockStopSleep\n
  *         APB7SMENR    LPTIM1SMEN    LL_APB7_GRP1_EnableClockStopSleep\n
  *         APB7SMENR    COMPSMEN      LL_APB7_GRP1_EnableClockStopSleep\n
  *         APB7SMENR    RTCAPBSMEN    LL_APB7_GRP1_EnableClockStopSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB7_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB7_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB7_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB7_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB7_GRP1_PERIPH_COMP (*)
  *         @arg @ref LL_APB7_GRP1_PERIPH_RTCAPB
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB7_GRP1_EnableClockStopSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB7SMENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB7SMENR, Periphs);
  (void)tmpreg;
}


/**
  * @brief  Check if APB7 peripheral clocks in Sleep and Stop modes is enabled or not
  * @rmtoll APB7SMENR    SYSCFGSMEN    LL_APB7_GRP1_IsEnabledClockStopSleep\n
  *         APB7SMENR    SPI3SMEN      LL_APB7_GRP1_IsEnabledClockStopSleep\n
  *         APB7SMENR    LPUART1SMEN   LL_APB7_GRP1_IsEnabledClockStopSleep\n
  *         APB7SMENR    I2C3SMEN      LL_APB7_GRP1_IsEnabledClockStopSleep\n
  *         APB7SMENR    LPTIM1SMEN    LL_APB7_GRP1_IsEnabledClockStopSleep\n
  *         APB7SMENR    COMPSMEN      LL_APB7_GRP1_IsEnabledClockStopSleep\n
  *         APB7SMENR    RTCAPBSMEN    LL_APB7_GRP1_IsEnabledClockStopSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB7_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB7_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB7_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB7_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB7_GRP1_PERIPH_COMP (*)
  *         @arg @ref LL_APB7_GRP1_PERIPH_RTCAPB
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB7_GRP1_IsEnabledClockStopSleep(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB7SMENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB7 peripheral clocks in Sleep and Stop modes
  * @rmtoll APB7SMENR    SYSCFGSMEN     LL_APB7_GRP1_DisableClockStopSleep\n
  *         APB7SMENR    SPI3SMEN       LL_APB7_GRP1_DisableClockStopSleep\n
  *         APB7SMENR    LPUART1SMEN    LL_APB7_GRP1_DisableClockStopSleep\n
  *         APB7SMENR    I2C3SMEN       LL_APB7_GRP1_DisableClockStopSleep\n
  *         APB7SMENR    LPTIM1SMEN     LL_APB7_GRP1_DisableClockStopSleep\n
  *         APB7SMENR    COMPSMEN       LL_APB7_GRP1_DisableClockStopSleep\n
  *         APB7SMENR    RTCAPBSMEN     LL_APB7_GRP1_DisableClockStopSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB7_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB7_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB7_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB7_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB7_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB7_GRP1_PERIPH_COMP (*)
  *         @arg @ref LL_APB7_GRP1_PERIPH_RTCAPB
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB7_GRP1_DisableClockStopSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB7SMENR, Periphs);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32WBAxx_LL_BUS_H */
